<a href="https://colab.research.google.com/github/joaovc800/Analise_de_dados/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#importando a bibliot√©ca pandas
import pandas as pd

In [ ]:
df = pd.read_csv("/content/drive/MyDrive/Datasets/dados.csv",sep=";")

In [ ]:
df.head()

       Nome  Idade      Profissao  Salario   Empresa
0      Joao     43   Service Desk     4833   Uninove
1  Vinicius     50   Service Desk     5235   Uninove
2  Denilson     31  Data Engineer     5432       IBM
3      Xuxa     43       Carteiro     1267  Correios
4  Fernando     34           Uber     1784      Uber

In [ ]:
df.shape

(18, 5)

In [ ]:
df.dtypes

Nome         object
Idade         int64
Profissao    object
Salario       int64
Empresa      object
dtype: object

In [ ]:
df.tail()

         Nome  Idade                   Profissao  Salario   Empresa
13   Ferreira     54          Chefe da seguranca     3537  Shopping
14    Antonio     33          Lider da seguranca     5230      Ford
15  VanderVan     56                    Porteiro     2063   Tulipas
16    Rogerio     24                   Seguranca     2342     Monza
17     Marcos     31  Analista de relacionamento     2296   Uninove

In [ ]:
df.describe()

           Idade      Salario
count  18.000000    18.000000
mean   39.222222  3431.000000
std    12.845487  1629.855966
min    18.000000  1267.000000
25%    31.000000  2121.250000
50%    38.000000  3220.500000
75%    51.500000  5130.750000
max    59.000000  5774.000000

In [ ]:
df["Empresa"].unique()

array(['Uninove', 'IBM', 'Correios', 'Uber', 'Fensa', 'Corinthians',
       'BMW', 'Cacau show', 'Shopping', 'Ford', 'Tulipas', 'Monza'],
      dtype=object)

In [ ]:
df.groupby("Empresa")["Nome"].nunique()

Empresa
BMW            1
Cacau show     1
Corinthians    1
Correios       1
Fensa          1
Ford           1
IBM            1
Monza          1
Shopping       1
Tulipas        1
Uber           1
Uninove        7
Name: Nome, dtype: int64